ode-soap-performance/bpelContent/Exponential.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Exponential/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.wscomposition.org/Exponential/" name="Exponential">
<types>
<xsd:schema>
<xsd:import namespace="http://www.wscomposition.org/Exponential/" schemaLocation="http://localhost:9003/Exponential?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="LogRequest">
<part name="param" type="xsd:double"></part>
</message>
<message name="LogRequestResponse">
<part name="return" type="tns:exponentialResponse"></part>
</message>
<portType name="ExponentialServiceImpl">
<operation name="LogRequest">
<input wsam:Action="http://www.wscomposition.org/Exponential/ExponentialServiceImpl/LogRequestRequest" message="tns:LogRequest"></input>
<output wsam:Action="http://www.wscomposition.org/Exponential/ExponentialServiceImpl/LogRequestResponse" message="tns:LogRequestResponse"></output>
</operation>
</portType>
<binding name="ExponentialSOAPBinding" type="tns:ExponentialServiceImpl">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
<operation name="LogRequest">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal" namespace="http://www.wscomposition.org/Exponential/"></soap:body>
</input>
<output>
<soap:body use="literal" namespace="http://www.wscomposition.org/Exponential/"></soap:body>
</output>
</operation>
</binding>
<service name="Exponential">
<port name="ExponentialSOAP" binding="tns:ExponentialSOAPBinding">
<soap:address location="http://localhost:9003/Exponential"></soap:address>
</port>
</service>
</definitions>